Tekla Open API Reference for Tekla Structures 2025
AnalysisPartBarAttributes Properties
The AnalysisPartBarAttributes type exposes the following members.
Properties
Name | Description
BarEndCondition
 The bar end condition.
BarStartCondition
 The bar start condition.
BarStartNumber
 The start number of the bar.
ForceStraightSegments
 The straight force segments.
MemberStartNumber
 The start number of the member.
OverrideProfileName
 The override profile name.
SplitDistances
 The split distances.
SplitNodeCount
 The count of the split node.
Top
See Also
Reference
AnalysisPartBarAttributes Class
Tekla.Structures.Analysis Namespace